[
    {
        "cct": "Reg",
        "descr": "It represents a region boundary. Its concept type may be irrelevant."
    },
    {
        "cct": "R(Loc)",
        "descr": "It represents all the locations within a field. For example, all the locations within a boolean field."
    },
    {
        "cct": "R(Loc,Nom)",
        "descr": "A field with a nominal attribute value. For example, areas with particular land use types."
    },
    {
        "cct": "R(Loc,Bool)",
        "descr": "A field with a boolean attribute value. For example, a boolean field representing being inside or outside of a buffer."
    },
    {
        "cct": "R(Loc,Ord)",
        "descr": "A field with an ordinal attribute value. For example, field drawn as a contour."
    },
    {
        "cct": "R(Loc,Itv)",
        "descr": "A field with an interval attribute value. For example, a field showing an average temperature."
    },
    {
        "cct": "R(Loc,Ratio)",
        "descr": "A field with a ratio attribute value. For example, a field representing distance from a certain location or object or density of objects."
    },
    {
        "cct": "R(Loc,Count)",
        "descr": "A field with a count attribute value."
    },
    {
        "cct": "R(Obj*Obj,Nom)",
        "descr": "A nominal quality (attribute) of a network."
    },
    {
        "cct": "R(Obj*Obj,Bool)",
        "descr": "A boolean quality (attribute) of a network."
    },
    {
        "cct": "R(Obj*Obj,Ord)",
        "descr": "An ordinal quality (attribute) of a network."
    },
    {
        "cct": "R(Obj*Obj,Itv)",
        "descr": "An interval quality (attribute) of a network."
    },
    {
        "cct": "R(Obj*Obj,Ratio)",
        "descr": "An interval quality (attribute) of a network. For example, an amount of traffic flow on a road segment or a network distance between a source and a destination."
    },
    {
        "cct": "R(Obj*Obj,Count)",
        "descr": "A count quality (attribute) of a network. For example, a number of cars on a road segment."
    },
    {
        "cct": "R(Obj*Obj,Reg)",
        "descr": "A network comprising of objects, events, or statistical grid units. For example, a path between objects."
    },
    {
        "cct": "R(Obj,Reg*Nom)",
        "descr": "A nominal quality/attribute of an object, event, or statistical grid unit. For example, a country name."
    },
    {
        "cct": "R(Obj,Reg*Bool)",
        "descr": "A boolean quality of an object, event, or statistical grid unit. For example, a sale status (for sale or not for sale) of houses."
    },
    {
        "cct": "R(Obj,Reg*Ord)",
        "descr": "An ordinal quality of an object, event, or statistical grid unit. For example, a priority level of fire accidents."
    },
    {
        "cct": "R(Obj,Reg*Itv)",
        "descr": "An interval quality of an object, event, or statistical grid unit. For example, a construction year of a building."
    },
    {
        "cct": "R(Obj,Reg*Ratio)",
        "descr": "A ratio quality of an object, event, or statistical grid unit. For example, an average population age of a neighbourhood."
    },
    {
        "cct": "R(Obj,Reg*Count)",
        "descr": "A count quality of an object, event, or statistical grid unit. For example, a number of people in a neighbourhood."
    },
    {
        "cct": "R(Obj,Reg)",
        "descr": "A region boundary of an object, event, or statistical grid unit."
    },
    {
        "cct": "R(Obj,_)",
        "descr": "An object, event, or a statistical grid unit. It may have an attribute with an unknown measurement level."
    },
    {
        "cct": "R(Reg,Nom)",
        "descr": "A region with a nominal attribute value. For example, land use types within a buffer area."
    },
    {
        "cct": "R(Reg,Bool)",
        "descr": "A region with a boolean attribute value."
    },
    {
        "cct": "R(Reg,Ord)",
        "descr": "A region with an ordinal attribute value. "
    },
    {
        "cct": "R(Reg,Itv)",
        "descr": "A region with an interval attribute value."
    },
    {
        "cct": "R(Reg,Ratio)",
        "descr": "A region with a count attribute value. For example, land use mix in a buffer area."
    },
    {
        "cct": "R(Reg,Count)",
        "descr": "A region with a count attribute value. For example, population in a buffer area."
    },
    {
        "cct": "R(Reg,_)",
        "descr": "It represents a region boundary that may have an attribute at any measurement level. For example, a statistical grid unit"
    },
    {
        "cct": "R(_,Nom)",
        "descr": "A nominal value that is either standalone or may belong to some unknown feature (e.g., object, event, field, etc)."
    },
    {
        "cct": "R(_,Bool)",
        "descr": "A boolean value that is either standalone or may belong to some unknown feature (e.g., object, event, field, etc)."
    },
    {
        "cct": "R(_,Ord)",
        "descr": "An ordinal value that is either standalone or may belong to some unknown feature (e.g., object, event, field, etc)."
    },
    {
        "cct": "R(_,Itv)",
        "descr": "An interval value that is either standalone or may belong to some unknown feature (e.g., object, event, field, etc)."
    },
    {
        "cct": "R(_,Ratio)",
        "descr": "A ratio value that is either standalone or may belong to some unknown feature (e.g., object, event, field, etc)."
    },
    {
        "cct": "R(_,Count)",
        "descr": "A count value that is either standalone or may belong to some unknown feature (e.g., object, event, field, etc)."
    },
    {
        "cct": "R(_,Reg)",
        "descr": "It represents a region boundary. Its concept type is unknown from question. For exmaple, an area with population larger than 10k."
    }
]